&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если ПараметрЗапуска = "autotest" Тогда
		ОткрытьФормуПоИмени("Autotest", Истина);
	Иначе
		ОткрытьФормуПоИмени("MainForm");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоИмени(НовоеИмя, Автотестирование = Ложь)
	
	ПараметрыФормы = Новый Структура("Autotest", Автотестирование);
	ПозицияРазделителя = СтрНайти(ИмяФормы, ".", НаправлениеПоиска.СКонца);
	НовоеИмяФормы = Лев(ИмяФормы, ПозицияРазделителя) + НовоеИмя;
	ОткрытьФорму(НовоеИмяФормы, ПараметрыФормы);
	
КонецПроцедуры

